jmeter/standard-async-order-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="smart-ticket-lite 标准异步下单压测" enabled="true">
      <stringProp name="TestPlan.comments">标准压测计划：CSV 参数化用户，动态获取幂等 token，提交 /api/orders/async，提取 requestId，可选轮询异步创单终态。正式压测请使用 non-GUI 模式。</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="全局变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">${__P(PROTOCOL,http)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(HOST,127.0.0.1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(PORT,8081)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">${__P(THREADS,50)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RAMP_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">RAMP_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(RAMP_SECONDS,30)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LOOP_COUNT" elementType="Argument">
            <stringProp name="Argument.name">LOOP_COUNT</stringProp>
            <stringProp name="Argument.value">${__P(LOOP_COUNT,20)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CSV_FILE" elementType="Argument">
            <stringProp name="Argument.name">CSV_FILE</stringProp>
            <stringProp name="Argument.value">${__P(CSV_FILE,jmeter/data/order-users.csv)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RISK_DECISION" elementType="Argument">
            <stringProp name="Argument.name">RISK_DECISION</stringProp>
            <stringProp name="Argument.value">${__P(RISK_DECISION,pass)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USE_CSV_IDEMPOTENCY_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">USE_CSV_IDEMPOTENCY_TOKEN</stringProp>
            <stringProp name="Argument.value">${__P(USE_CSV_IDEMPOTENCY_TOKEN,false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="POLL_RESULT" elementType="Argument">
            <stringProp name="Argument.name">POLL_RESULT</stringProp>
            <stringProp name="Argument.value">${__P(POLL_RESULT,true)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="POLL_MAX_TRIES" elementType="Argument">
            <stringProp name="Argument.name">POLL_MAX_TRIES</stringProp>
            <stringProp name="Argument.value">${__P(POLL_MAX_TRIES,60)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="POLL_INTERVAL_MS" elementType="Argument">
            <stringProp name="Argument.name">POLL_INTERVAL_MS</stringProp>
            <stringProp name="Argument.value">${__P(POLL_INTERVAL_MS,500)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 默认配置" enabled="true">
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 用户与活动参数" enabled="true">
        <stringProp name="filename">${CSV_FILE}</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">authToken,showId,sessionId,ticketCategoryId,quantity,admissionToken,idempotencyToken</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP 请求头" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${authToken}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">X-Smart-Ticket-Risk-Decision</stringProp>
            <stringProp name="Header.value">${RISK_DECISION}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="标准异步下单线程组" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${LOOP_COUNT}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="异步下单完整链路" enabled="true">
          <boolProp name="TransactionController.parent">true</boolProp>
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="动态获取幂等 token" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get(&apos;USE_CSV_IDEMPOTENCY_TOKEN&apos;) != &apos;true&apos;)}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/orders/idempotency-token" enabled="true">
              <stringProp name="HTTPSampler.path">/api/orders/idempotency-token</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取幂等 token" enabled="true">
                <stringProp name="JSONPostProcessor.referenceNames">idempotencyToken</stringProp>
                <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token</stringProp>
                <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
                <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
              </JSONPostProcessor>
              <hashTree/>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="幂等 token 响应断言" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="0">&quot;code&quot;:0</stringProp>
                  <stringProp name="1">&quot;token&quot;</stringProp>
                </collectionProp>
                <stringProp name="Assertion.custom_message">获取幂等 token 失败</stringProp>
                <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">2</intProp>
              </ResponseAssertion>
              <hashTree/>
            </hashTree>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/orders/async" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;showId&quot;:${showId},&quot;sessionId&quot;:${sessionId},&quot;ticketCategoryId&quot;:${ticketCategoryId},&quot;quantity&quot;:${quantity},&quot;idempotencyToken&quot;:&quot;${idempotencyToken}&quot;,&quot;admissionToken&quot;:&quot;${admissionToken}&quot;}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/orders/async</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取 requestId" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">requestId</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.requestId</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="异步下单提交断言" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="0">&quot;code&quot;:0</stringProp>
                <stringProp name="1">&quot;requestId&quot;</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">异步下单提交失败，没有拿到 requestId</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="轮询异步创单结果" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get(&apos;POLL_RESULT&apos;) == &apos;true&apos; &amp;&amp; vars.get(&apos;requestId&apos;) != null &amp;&amp; vars.get(&apos;requestId&apos;) != &apos;NOT_FOUND&apos;)}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
            <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="初始化轮询变量" enabled="true">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="cacheKey">init-poll-vars</stringProp>
              <stringProp name="script">vars.put(&apos;orderStatus&apos;, &apos;PENDING&apos;)
vars.put(&apos;pollCount&apos;, &apos;0&apos;)</stringProp>
            </JSR223Sampler>
            <hashTree/>
            <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="等待订单请求进入终态" enabled="true">
              <stringProp name="WhileController.condition">${__groovy(vars.get(&apos;orderStatus&apos;) != &apos;SUCCESS&apos; &amp;&amp; vars.get(&apos;orderStatus&apos;) != &apos;FAILED&apos; &amp;&amp; vars.get(&apos;orderStatus&apos;) != &apos;CANCELLED&apos; &amp;&amp; vars.get(&apos;orderStatus&apos;) != &apos;COMPENSATED&apos; &amp;&amp; vars.get(&apos;pollCount&apos;).toInteger() &lt; vars.get(&apos;POLL_MAX_TRIES&apos;).toInteger())}</stringProp>
            </WhileController>
            <hashTree>
              <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="轮询次数加一" enabled="true">
                <stringProp name="scriptLanguage">groovy</stringProp>
                <stringProp name="cacheKey">increment-poll-count</stringProp>
                <stringProp name="script">vars.put(&apos;pollCount&apos;, (vars.get(&apos;pollCount&apos;).toInteger() + 1).toString())</stringProp>
              </JSR223Sampler>
              <hashTree/>
              <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="轮询间隔" enabled="true">
                <stringProp name="ConstantTimer.delay">${POLL_INTERVAL_MS}</stringProp>
              </ConstantTimer>
              <hashTree/>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/order-requests/{requestId}" enabled="true">
                <stringProp name="HTTPSampler.path">/api/order-requests/${requestId}</stringProp>
                <stringProp name="HTTPSampler.method">GET</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取订单请求状态" enabled="true">
                  <stringProp name="JSONPostProcessor.referenceNames">orderStatus,orderId,failReason</stringProp>
                  <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.status;$.data.orderId;$.data.failReason</stringProp>
                  <stringProp name="JSONPostProcessor.match_numbers">1;1;1</stringProp>
                  <stringProp name="JSONPostProcessor.defaultValues">UNKNOWN;NONE;NONE</stringProp>
                </JSONPostProcessor>
                <hashTree/>
              </hashTree>
            </hashTree>
            <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="异步创单终态断言" enabled="true">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="cacheKey">assert-terminal-status</stringProp>
              <stringProp name="script">def terminal = [&apos;SUCCESS&apos;,&apos;FAILED&apos;,&apos;CANCELLED&apos;,&apos;COMPENSATED&apos;]
if (!terminal.contains(vars.get(&apos;orderStatus&apos;))) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&apos;异步订单请求未在限定轮询次数内进入终态，requestId=&apos; + vars.get(&apos;requestId&apos;) + &apos;, status=&apos; + vars.get(&apos;orderStatus&apos;))
}</stringProp>
            </JSR223Assertion>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>